dannyf00/Another-Arduino-Clone/stm32duino.h
//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm1Init(uint16_t TxCCP_PS);

//set duty cycle
#define pwm1SetDC1(dc)		TIM1->CCR1 = (dc)
#define pwm1SetDC2(dc)		TIM1->CCR2 = (dc)
#define pwm1SetDC3(dc)		TIM1->CCR3 = (dc)
#define pwm1SetDC4(dc)		TIM1->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm3Init(uint16_t TxCCP_PS);

//set duty cycle
#define pwm3SetDC1(dc)			TIM3->CCR1 = (dc)
#define pwm3SetDC2(dc)			TIM3->CCR2 = (dc)
#define pwm3SetDC3(dc)			TIM3->CCR3 = (dc)
#define pwm3SetDC4(dc)			TIM3->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm14Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm14SetDC1(dc)			TIM14->CCR1 = (dc)
#define pwm14SetDC2(dc)			TIM14->CCR2 = (dc)
#define pwm14SetDC3(dc)			TIM14->CCR3 = (dc)
#define pwm14SetDC4(dc)			TIM14->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm15Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm15SetDC1(dc)			TIM15->CCR1 = (dc)
#define pwm15SetDC2(dc)			TIM15->CCR2 = (dc)
#define pwm15SetDC3(dc)			TIM15->CCR3 = (dc)
#define pwm15SetDC4(dc)			TIM15->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm16Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm16SetDC1(dc)			TIM16->CCR1 = (dc)
#define pwm16SetDC2(dc)			TIM16->CCR2 = (dc)
#define pwm16SetDC3(dc)			TIM16->CCR3 = (dc)
#define pwm16SetDC4(dc)			TIM16->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm17Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm17SetDC1(dc)			TIM17->CCR1 = (dc)
#define pwm17SetDC2(dc)			TIM17->CCR2 = (dc)
#define pwm17SetDC3(dc)			TIM17->CCR3 = (dc)
#define pwm17SetDC4(dc)			TIM17->CCR4 = (dc)

//adc
//adc channel definitions
#define ADC_CH0			(1ul<<0)
#define ADC_CH1			(1ul<<1)
#define ADC_CH2			(1ul<<2)
#define ADC_CH3			(1ul<<3)
#define ADC_CH4			(1ul<<4)
#define ADC_CH5			(1ul<<5)
#define ADC_CH6			(1ul<<6)
#define ADC_CH7			(1ul<<7)
#define ADC_CH8			(1ul<<8)
#define ADC_CH9			(1ul<<9)
#define ADC_CH10		(1ul<<10)
#define ADC_CH11		(1ul<<11)
#define ADC_CH12		(1ul<<12)
#define ADC_CH13		(1ul<<13)
#define ADC_CH14		(1ul<<14)
#define ADC_CH15		(1ul<<15)
#define ADC_CH16		(1ul<<16)
#define ADC_CH17		(1ul<<17)
#define ADC_TS			ADC_CH16				//tempeature sensor on CH16
#define ADC_VREFINT		ADC_CH17				//internal reference on CH17 @ 1.20v

//convert temperature sensor adc reading into temperaturex10
//follow the datasheet. 3.3v Vref (3.0v for my board), 12bit adc
#define Tx10(adc)		(3529 - ((uint32_t) (3300*10*10/43 * (adc)) >> 12))

//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adc1Init(void);
uint16_t adc1Read(uint32_t adc_ch);

//read the adc
#define analogRead(ch)	adc1Read(ch)
//end ADC

//input capture
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void);
void ic1AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic1Get(void);							//read buffer value

void ic2Init(void);
void ic2AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic2Get(void);							//read buffer value

void ic3Init(void);
void ic3AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic3Get(void);							//read buffer value

void ic4Init(void);
void ic4AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic4Get(void);							//read buffer value

void ic5Init(void);
void ic5AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic5Get(void);							//read buffer value
//end input capture

//extint
void int0Init(void);							//initialize the module
void int0AttachISR(void (*isrptr) (void));		//attach user isr

void int1Init(void);							//initialize the module
void int1AttachISR(void (*isrptr) (void));		//attach user isr

void int2Init(void);							//initialize the module
void int2AttachISR(void (*isrptr) (void));		//attach user isr

void int3Init(void);							//initialize the module
void int3AttachISR(void (*isrptr) (void));		//attach user isr

void int4Init(void);							//initialize the module
void int4AttachISR(void (*isrptr) (void));		//attach user isr
//end extint

//spi

void spi1Init(uint16_t br);						//reset the spi
void spi1Write(uint8_t dat);					//send data via spi
#define spi1Busy()			(SPI1STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi1Available()		(!SPI1STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi1Read()			(SPI1BUF)			//read from the buffer

void spi2Init(uint16_t br);						//reset the spi
void spi2Write(uint8_t dat);					//send data via spi
#define spi2Busy()			(SPI2STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi2Available()		(!SPI2STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi2Read()			(SPI2BUF)			//read from the buffer

//end spi

//i2c
//end i2c

//rtcc

//end rtcc

//cnint
//pin: one pin only
//gpio: GPIOA..GPIOG
void extiInit(GPIO_TypeDef * gpio, uint16_t pin, uint8_t edge);
void extiAttachISR(uint16_t pin, void (*isr_ptr)(void));		//install user handler

//end cnint


#endif
